from news_parser import NewsParser
from stocks_parser import StockParser

keywords_dict = {
    "SBER":["СБЕР", "Сбербанк", "Сбер", "Сберколл", "Сбербизнес", "Сбертек", "Сбермаркет", "Мегамаркет", "Греф", "Сберколлектор", "Сбербизнес", "Сбертек", "Сбермаркет", "СберЛогистика", "СберЛизинг", "СберНедвижимость", "Сбербанк-АСТ", "Сбербанк-Резерв", "Сбербанк-Спасение", "Сбербанк-Страхование", "Сбербанк-Технологии", "Сбербанк-Эквайринг", "Сбербанк-Эксперт", "Сбербанк-Контактный Центр"],
    "GAZP":["GAZP", "Газстройпром", "Газпром", "Газпромнефть", "Газпромбанк", "Газпроммедиа", "Газпромтранс", "Газпромдобыча", "Газпромэнерго", "Газпромавиа", "Газпроммежрегионгаз", "Газпроминвестходинг", "Газпромнедра", "Газпромпереработка", "Газпромпоставка", "Газпроммонтаж", "Газпромвнешэкономбанк", "Газпромснаб", "Газпромавтоматизация", "Газпромкомплектация", "Газпромгазораспределение", "Газпромэнергосбыт", "Газпромнефтегаз", "Газпромгазэнергосбыт", "Газпромкапитал", "Газпромстрой", "Газпромнефтьцентр", "Газпромтрансгаз", "Газпромбурение", "Газпромперевозка", "Газпромавтоматика"],
    "LKOH":["LKOH", "Лукойл", "Лукойл-Нефтепродукт", "Лукойл-Гарант", "Лукойл-Инжиниринг", "Лукойл-Москва", "Лукойл-Пермь", "Лукойл-Уралнефтегаз", "Лукойл-Западная Сибирь", "Лукойл-Волгограднефтепродукт", "Лукойл-Калуга", "Лукойл-Трейд", "Лукойл-Нижегороднефтепродукт", "Лукойл-Югнефтепродукт", "Лукойл-Кубаньнефтепродукт", "Лукойл-Казахстан", "Лукойл-Азербайджан", "Лукойл-Украина", "Лукойл-Гео", "Лукойл-Газпром", "Лукойл-Технологии", "Лукойл-Центрнефтепродукт", "Лукойл-Волгограднефтехим", "Лукойл-Юг", "Лукойл-Информ", "Лукойл-Север", "Лукойл-Калининграднефтепродукт", "Лукойл-Центр", "Лукойл-Санкт-Петербург", "Лукойл-Северозапад", "Лукойл-Московиянефтепродукт", "Лукойл-Сургутнефтепродукт", "Лукойл-Холдинг", "Лукойл-Сибирь", "Лукойл-Энергосбыт"],
    "MTSS": ["MTSS", "МТС", "Мобильные ТелеСистемы", "МТС-Банк", "MTS Money", "МТС-Медиа", "МТС-Телеком", "МТС-Украина", "МТС-Туркменистан", "МТС-Беларусь", "МТС-Армения", "МТС-Киргизия", "МТС-Узбекистан", "МТС-Индия", "МТС-Таджикистан", "МТС-Армения", "МТС-Казахстан", "МТС-Туркменистан", "МТС-Туркменистан", "МТС-Турция", "МТС-Грузия", "МТС-Киргизия", "МТС-Монтенегро", "МТС-Мьянма", "МТС-Сейшелы", "МТС-Шри-Ланка", "МТС-Гана", "МТС-Нигерия", "МТС-Иран", "МТС-Афганистан", "МТС-Пакистан", "МТС-Армения"]
}



news_parser = NewsParser("https://bcs-express.ru/category/sberbank", keywords_dict['SBER'])

news_dataset = news_parser.parse_and_return_dataset(stop_date='2023-12-01')

print(news_dataset)